Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures.NoKeynoteAssignedToLinkedElement
The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.

Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures.KeynoteOnLinkWithDifferentKeynoteFile
The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.

Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures
Failures related to keynote tags.